{
  "title": "6 Best Fantasy Books according to Twitter 📚",
  "date": "2020-03-22T04:07:00.000Z",
  "description": "It can be hard to choose what to read next, and so I've asked the people what fantasy books they like most. Here are their top ten recommendations 📚",
  "tags": [
    "Fantasy",
    ""
  ],
  "body": "On Saturday I [tweeted](https://twitter.com/Willsimulated/status/1241253353834696704) a simple question asking for your favourite fantasy book, and the feedback was amazing!\n\n![A screenshot of Will Stone's Twitter asking 'What is your favourite Fantasy book?'](/img/twitter.png \"Best Fantasy books\")\n\nNow, other than my slight typo with asking for an individual Fantasy book and responding with a series (forever to my shame as a writer) the responses were both deeply insightful and helped to greatly fatten up by own writing list. Therefore, according to Twitter these are the ten **Best Fantasy Books** and **Best Fantasy Series** (again, my apologies) of all time!\n\n## 1. Discworld\n\n![Paul said \"Discworld, it's one of the most grounded Fantasy Series.\"](/img/1.png \"Discworld, it's one of the most grounded Fantasy Series\")\n\nA cult classic, the **Comedic Fantasy** 'Discworld' is certainly a popular novel with its iterations spanning from the very first book 'The Colour of Magic' being published in 1983 to the very latest title 'The Sheperd's Crown' in 2015.  If you're interested in a good laugh, this is definitely worth a read.\n\n## 2. The Black Company by Glen Cook\n\n![The Black Company](/img/2.png \"The Black Company\")\n\nIf your looking for a **Dark Fantasy** where we follow the intrepid adventures of a grizzly band of mercenaries, then this is the book for you! Expertly chosen, The Black Company is widely adored amongst those who want to feel the true grit of a full-fledged fantasy world, and be exposed warts-and-all to it's tiniest details.\n\n## 3. Wheel Of Time by James Oliver Rigney Jr & Brandon Sanderson\n\n![Wheel of Time on Twitter](/img/3.png \"Wheel of Time on Twitter\")\n\nWhile it hurts me 'Wheel of Time' came so low on the list, it is an awesome example of just how far **Epic Fantasy** can be taken. All you need to know is that the series itself is 15 books long, and the story is incredible. For more information, please refer to my response below to another Twitter user asking whether they should read it:\n\n![Wheel of Time is Awesome](/img/dude.png \"Wheel of Time is Awesome\")\n\n## 4. The Fionavar Tapestry by Guy Gavriel Kay\n\n![The Fionavar Tapestry](/img/34.png \"The Fionavar Tapestry\")\n\nA **Pure Fantasy** each of The Five in this story are set upon a different path, that swings between our contemporary world and the world of Fionavar. If you're looking to be transported to a faraway place, then this trilogy is the one for you!\n\n## 5. The Way Of Kings by Brandon Sanderson\n\n![The Way Of Kings by Brandon Sanderson Twitter](/img/5.png \"The Way Of Kings by Brandon Sanderson Twitter\")\n\nBut Will... you've included 'The Wheel of Time' again? Indeed I have, for while Brandon is the author of 'The Way Of Kings' he is also the writer for the last three 'Wheel of Time' books and I thought he should get some thanks for it. More importantly, Brandon has embarked on one of the most epic undertakings of our generation.\n\nThe first book in the 'Stormlight Archive' series, Brandon has written a one thousand page masterpiece in the **High Fantasy** genre. The quality of writing is astounding, the world-building truly next level, and the content expansive to say the least. I highly recommend giving any of Brandon's works a read, but do be warned, they are so long that unless if you have plenty of free time it might be both the next and last series you ever read (on account of never getting to the end.)\n\n## **6. The Silmarillion by J. R. R. Tolkien**\n\n![The Silmarillion by J. R. R. Tolkien on Twittero](/img/6.png \"The Silmarillion by J. R. R. Tolkien on Twitter\")\n\nNow I know what you must be saying, 'Will, this doesn't have very many likes now does it?' and to that I respond: yes. For you see The Silmarillion (out of the choices to select from) is certainly an excellent work of **High Fiction** that works in parallel to the Lord of the Rings.\\\nWritten in the same universe, the sometimes strange storyline is nonetheless the very last stop of any true Lord Of the Rings fan. You can glean insights into the Lord of the Rings universe from it's very inception, and clues into how the whole of Middle Earth might progress into the future. I'll end you with this little piece of advice: give it a chance, for the opening chapters are nigh cryptic in meaning, and you'll have to push through to really get the most of of Tolkien's final work.\n\n## To be continued\n\nI'll be looking into revising this list with updated content after renewed 'surveys' conducted through Twitter. If you want to see a book unmentioned rise to take a place (or be added below) then please navigate to my [Twitter](https://twitter.com/Willsimulated/status/1241253353834696704) and comment/like to vote your favourite Fantasy Book/series to become a true contender."
}