{
  "title": "Will Stone Writing tips & Books",
  "homepage-1": "Welcome to those wanting to learn **[writing tips](https://willstoneauthor.com/news)** and the progress with my own **[books](https://willstoneauthor.com/books)**.\n\nCheck out the latest [news](https://willstoneauthor.com/news) and check back regularly for more content :)",
  "homepage-2": "I'm always on the look out for new ways to improve my own writing skills, and love to grind down all the hard stuff into a much easier to understand summary. To see the output of my research, check out the news tab and have a look at the resources presented there.\n\nFollow me on [Twitter](https://twitter.com/Willsimulated) to reach out to me directly",
  "free-chapters-download-box": {
    "text": "Yeah, this does not work for the time being.",
    "button": "Join the cult"
  },
  "about-1": "# **Will Stone**\n\nA Melbourne based Cyberpunk author. Lover of extreme worlds, and prone to endlessly clicking through Wikipedia. To reach out to me, contact me on Twitter at @willsimulated. My current project is Cyberblade Deviant, a cyberpunk story set in the far-flung future of humanity where the majority of humans live in gigantic Enginecities deep below the earth.",
  "books-1": "# Cyberblade Deviant - A Cyberpunk story\n\nSet in the expansive Cyberblade universe, **Cyberblade Deviant** follows the story of Lex Vulcan and her quest to escape the dystopian hell of Trozen's Undercity. Yet her quest takes her away from her dreams of a life on the fertile surface, and deep into Troezen's underbelly. To build a better life she must hunt rogue cyborgs, mad revolutionaries, and fight for her very survival.\n\n## A dystopian Cyberpunk world\n\nWith heavy **Cyberpunk themes**, you can expect neo-capitalistic Megacorporations, corrupt government officials, and a dog eats dog world where the strong survive by preying on the weak. In such a world, where Lex just wants to save her family from annihilation, there are a thousand and one ways for it all to go terribly wrong.\\\nYet when Megacorp and Protectorate forces alike start competing the source of strange meta-physical anomalies the fate of Troezen, and all its people, seemingly remains in the hands of fate. Or that of a kill willing to kill to save those she loves.\n\n## **Familiar themes from Cyberpunk classics**\n\nIf you're a fan of **Cyberpunk 2077**, then you'll love the expansive Cyberblade world and it's endless possibilites for technological horrors, cyberized battles, and gritty black-market drive underworlds.",
  "news-1": "Enjoy yourself down there, although don't blame me when it gets too crazy  ¯\\\\_(ツ)\\_/¯"
}