{
  "title": "Will Stone Writing tips & Books",
  "homepage-1": "\n\nWelcome to this recource for those wanting to learn about **[writing tips](https://willstoneauthor.com/news)** and progress with my own **[books](https://willstoneauthor.com/books)**.\n\nCheck out the latest here [news](https://willstoneauthor.com/news) and check back regularly for more content :)",
  "homepage-2": "I'm always on the look out for new ways to improve my own writing skills, and love to make reports to grind down all the hard stuff into a much easier to understand report. To see the output of my research, check out the news tab and have a look at the resources presented there.\n\nFollow me on [Twitter](https://twitter.com/Willsimulated) to reach out to me directly",
  "free-chapters-download-box": {
    "text": "This is silly isn't it?",
    "button": "Join the cult"
  },
  "about-1": "**LitRPG and High Fantasy Author: Will Stone**\n\nI'm currently working on a book with a working title of '[Hero Souls](https://willstoneauthor.com/books)' that I plan to release late 2020.\n\n**LitRPG**\n\nHero Souls is a litRPG that draws upon the Eastern 'Reincarnated' genre as well as the typical gamified 'LitRPG' genre. If you want to read a story about an avid gamer in a fanasy world, fighting it out with magical creatures and dealing with heartbreaking tragedy and awesome achievements in equal measure then I definitly reccomend you give Hero Souls a read!\n\n**Will Stone is a Melbourne Author**\n\nAs a Melbourne Author I am a native Australian, but love my fans both abroad and domestic. I'm a huge fan of works by **High Fantasy Authors** and **Science-fiction Authors** such as Brandon Sanderson, Isaac Asimov, and everthing in between! After reading for two decades, I've fallen in love with the world of literature out there and have now written every day for several years in my goal to one day join the ranks of these champions of the literary world. Yet with a full-time job, I've only been able to get a few hours a day in each morning by getting up at 5:45AM and writing like clockwork until it's time to go to work.\n\n**How I got my Story Writing Skills**\n\nI've spent many years refinining my **storytelling** and **short story** skills with univerisity classes, endless personal projects and a handful of local competitions. My usual style of improvement is to write a ton, read like a machine, and then figure out how to improve on what I achieved yesterday. In this mannor I have churned out over a million words a year since my journey began, and plan to ramp up that pace as I build up more free time to write.",
  "books-1": "# Hero Souls: Requiem\n\n## A Fantasy story for the gamers\n\n**Hero Souls** is a fresh off the keyboard litRPG series.\n\nFollow Kenji the entrepid **Gamer** as he uses the skills he learned gaming on Earth in a **fantasy setting**.\n\nTransported to a **fantasy world**, Kenji must used his wit and special powers to compete against the 18 Evil Souls that seek to throw the world into chaos. Thinking quickly, Kenji wields his powers as a \\[Forbidden Mimic] to replicate the strengths, weaknesses and memories of others to outrun the Church, the King, the Three and the One.\n\nYet even with an amazing power, fast-thinking cunning, and endless cultural references, nothing remains certain. Can Kenji thrive in this new world? Or will he fall before all those who would oppose him, and bring the people of Alandria down with him.",
  "news-1": "Guess what? I don't have any news for you right now  ¯\\\\_(ツ)\\_/¯"
}